FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_GPDMA.c
    // Make local reference to the created workspace. Used in interrupt handler.
    G_workspaceGPDMAChannel[aChannel] = aWorkspace;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPDMA_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1788 GPDMA iChannel workspaces.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPDMA_InitializeWorkspace_Channel0(void *aWorkspace)
{
    return LPC1788_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL0);
}
T_uezError LPC1788_GPDMA_InitializeWorkspace_Channel1(void *aWorkspace)
{
    return LPC1788_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL1);
}
T_uezError LPC1788_GPDMA_InitializeWorkspace_Channel2(void *aWorkspace)
{
    return LPC1788_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL2);
}
T_uezError LPC1788_GPDMA_InitializeWorkspace_Channel3(void *aWorkspace)
{
    return LPC1788_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL3);
}
T_uezError LPC1788_GPDMA_InitializeWorkspace_Channel4(void *aWorkspace)
{
    return LPC1788_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL4);
}
T_uezError LPC1788_GPDMA_InitializeWorkspace_Channel5(void *aWorkspace)
{
    return LPC1788_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL5);
}
T_uezError LPC1788_GPDMA_InitializeWorkspace_Channel6(void *aWorkspace)
{
    return LPC1788_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL6);
}
T_uezError LPC1788_GPDMA_InitializeWorkspace_Channel7(void *aWorkspace)
{
    return LPC1788_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL7);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPDMA_Stop
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable GPDMA iChannel. Data is lost if is in DMA FIFO.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPDMA_Stop(void *aWorkspace)
{

    T_LPC1788_GPDMA_Workspace *p = (T_LPC1788_GPDMA_Workspace *)aWorkspace;

    // Zero out the enable bit
    G_channelRegs[p->iChannel]->CConfig &= ~(1 << 0);

#if 0 // currently not supported
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP0_TX)
    SSP0DMACR &= ~SSP0DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP0_RX)
    SSP0DMACR &= ~SSP0DMACR_RXDMAE_MASK;
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP1_TX)
    SSP1DMACR &= ~SSP1DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP1_RX)
    SSP1DMACR &= ~SSP1DMACR_RXDMAE_MASK;
#endif
    // Fill the structure with default value for iControl and attributes.
    p->iControl = 0;

    return UEZ_ERROR_NONE;

}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPDMA_ChannelIsEnabled
 *---------------------------------------------------------------------------*
 * Description:
 *      Check if GPDMA iChannel is enabled -> transfer in progress.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      TBool                   -- Enabled ETrue else EFalse
 *---------------------------------------------------------------------------*/
static TBool LPC1788_GPDMA_ChannelIsEnabled(void *aWorkspace)
{
    T_LPC1788_GPDMA_Workspace *p = (T_LPC1788_GPDMA_Workspace *)aWorkspace;

    // Enabled iChannel
    return (LPC_GPDMA->EnbldChns & (1 << p->iChannel)) ? ETrue : EFalse;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPDMA_Start
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable GPDMA iChannel -> begin new transfer.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPDMA_Start(void *aWorkspace)
{
//    TUInt32 regValue = 0;
    T_LPC1788_GPDMA_Workspace *p = (T_LPC1788_GPDMA_Workspace *)aWorkspace;
    LPC_GPDMACH_TypeDef *p_channel;

    // Test if we can enable the iChannel.
    if (p->iControl == 0 || ETrue == LPC1788_GPDMA_ChannelIsEnabled(aWorkspace))
        return UEZ_ERROR_NOT_READY;

    //Clear any pending interrupts on the iChannel
    LPC_GPDMA->IntTCClear = 1 << p->iChannel;
    LPC_GPDMA->IntErrClr = 1 << p->iChannel;

    // Memory to memory transfer;
//    regValue |= ((0x0 & DMACCConfiguration_FlowCntrl_MASK)
//            << DMACCConfiguration_FlowCntrl_BIT) | DMACCConfiguration_E;

    // If the callback is set, process interrupts.
//    if (NULL != p->iISRCallback)
//        regValue |= DMACCConfiguration_IE | DMACCConfiguration_ITC;

    p_channel = G_channelRegs[p->iChannel];
    p_channel->CSrcAddr = p->iSource;
    p_channel->CDestAddr = p->iDestination;

    // linked list?
    p_channel->CLLI = p->iLinkedList;

    // Write the iControl information into the DMACCxControl Register
    p_channel->CControl = p->iControl;

    // Enable iChannel.
    p_channel->CConfig = p->iConfiguration;

#if 0 // Not currently supported
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP0_TX)
    SSP0DMACR |= SSP0DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP0_RX)
    SSP0DMACR |= SSP0DMACR_RXDMAE_MASK;
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP1_TX)
    SSP1DMACR |= SSP1DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP1_RX)
    SSP1DMACR |= SSP1DMACR_RXDMAE_MASK;
#endif

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPDMA_Enable
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable GPDMA controller and register interrupt handler.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
static void LPC1788_GPDMA_Enable(void *aWorkspace)
{
    (void)aWorkspace;

    // Increase number of G_opened channels.
    G_opened++;

    // Enable peripheral power (PCGPDMA)
    LPC1788PowerOn(1 << 29);

    // Was registered already?
    if (EFalse == InterruptIsRegistered(INTERRUPT_CHANNEL_GP_DMA)) {
        // Enable interrupt.
        InterruptRegister(INTERRUPT_CHANNEL_GP_DMA, (TISRFPtr)IGPDMA,
            INTERRUPT_PRIORITY_NORMAL, "GPDMA");
        InterruptEnable(INTERRUPT_CHANNEL_GP_DMA);
    }

    // Enable GPDMA by writing ENABLE bit.
    // Always little-endian.
    LPC_GPDMA->Config = DMACCConfiguration_E;
}

/*---------------------------------------------------------------------------*
 * Routine:  IPeripheralToIndex
 *---------------------------------------------------------------------------*
 * Description:
 *      Convert a peripheral number into an index in the DMA registers.
 * Inputs:
 *      T_gpdmaRequest aPeripherl   -- Peripheral type from Types/GPDMA.h
 * Outputs:
 *      TUInt32 -- Index or GPDMA_PERIPHERAL_UNKNOWN if unknown
 *---------------------------------------------------------------------------*/
static TUInt32 IPeripheralToIndex(T_gpdmaPeripheral aPeripheral)
{
    TUInt32 index = GPDMA_PERIPHERAL_UNKNOWN;
    if (aPeripheral <= GPDMA_PERIPHERAL_UART4_RX) {
        return G_peripheralMap[aPeripheral] & GPDMA_PERIPHERAL_MASK;
    }
    return index;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPDMA_PrepareRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Set up GPDMA iChannel.
 * Inputs:
 *      void *aW                       -- Particular GPDMA workspace
 *      const T_gpdmaRequest *aRequest -- Request to prepare
 *      T_gpdmaCallback aISRCallback   -- Routine to call when complete, or 0
 *                                       for none.
 *      void *aISRCallbackWorksspace   -- Pointer to data passed to callback
 *                                         routine.
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPDMA_PrepareRequest(
    void *aWorkspace,
    const T_gpdmaRequest *aRequest,
    T_gpdmaCallback aISRCallback,
    void *aISRCallbackWorkspace)
{
    TUInt32 control;
    TUInt32 flow;
    TUInt32 perip;

    T_LPC1788_GPDMA_Workspace *p = (T_LPC1788_GPDMA_Workspace *)aWorkspace;

    // Load the destination & source address into the iControl block.
    // (Note: These only apply to memory transfers)
    p->iSource = (TUInt32)aRequest->iSourceAddr;
    p->iDestination = (TUInt32)aRequest->iDestinationAddr;

    // Load the iControl word.
    control = aRequest->iControl;

    // Channel 0 and 1 have the same defines, so only iChannel 0 is used.

    // Set the transfer size and mode in the iControl word.
    control |= (aRequest->iNumTransferItems << DMACCControl_TransferSize_BIT)
        & DMACCControl_TransferSize_MASK;

